{"response":{"result":1,"resultcount":1,"publishedfiledetails":[{"publishedfileid":"1445395055","result":1,"creator":"76561198041775263","creator_app_id":346110,"consumer_app_id":346110,"filename":"","file_size":322343999,"file_url":"http://depotcontent.akamai.steamusercontent.com/staticcontent/346110/614094907/depot_346110_2966018322961323430.zip","hcontent_file":"2966018322961323430","preview_url":"https://steamuserimages-a.akamaihd.net/ugc/956349495972992578/9785925E10262BE71872F0A579A5B5237A920E00/","hcontent_preview":"956349495972992578","title":"ARK Additions: Domination Rex!","description":"MOD ID 1445395055\r\n\r\n-------------------------------------------------------\r\n\r\n[URL=https://steamcommunity.com/sharedfiles/filedetails/changelog/1445395055]PLEASE CHECK PATCH NOTES HERE![/url]\r\n\r\nBig Thanks to UpFromTheDepths for the Trailer! Check out their Youtube Channel [url=https://www.youtube.com/channel/UC96TbdXc0qubpc8EpG6--Zg]here![/url]\r\n\r\nAdded the horrific Domination Rex to the ARK!\r\n\r\nThe Domination Rex is a very unique addition... it doesn't spawn in the wild. To acquire or even see a Dominator, you have to engineer a Domination Rex Egg, which can be learned at level 100. The Egg requires some difficult materials to obtain, so don't expect an easy Domination Rex!\r\nOnce you have your baby Dominator, be careful! Baby Dominators, all the way to adulthood have a tendency to get very grumpy, and could potentially attack you or your tames at any moment, so don't raise a dominator in the company of others!. Once fully grown, Dominators are one of the most powerful mounts in the game, with a multitude of abilities, such as a resistance to Giga's bleed, and a buff against boss enemies and alphas!\r\n\r\nLeft-Click is a Bite attack, which can damage stone\r\nRight-Click is a claw slashing attack, which hits twice and does pierce. As a random added bonus, it can gather wood and thatch with this move.\r\nHolding Right-Click starts a pin attempt. If the Dominator succesfully pins a creature within its grab weight threshhold, it will proceed to outright kill that creature. Successfully performing a pin also grants the Dominator a considerable healing buff!\r\nC Key activates Domination Rex Camo, which acts basically identical to Rock Drake Camo, with all the same benefits!\r\nLeft Control is a Dominator Roar. This doesn't do anything, but looks really cool, and can be used while moving!\r\n\r\nDomination Rex has several perks in addition to its moveset: \r\n\r\nDomination Rex grants a Hypothermal and Hypertheraml Insulation buff to its rider.\r\nDomination Rex is immune to several damage types, such as Giga's gnash/bleed effect, Allo/Deinosuchus gash, and bleeding\r\nDomination Rex gets a buff when it detects the presence of powerful creatures (bosses, alphas, and raid dinos). When this occurs, the Dominator gets a 15% damage increase, and a small increase to resistance! This makes Dominators' incredibly useful to have in boss fights, or in battling alphas.\r\n\r\nThere are 4 Domination variants total, one for each map. Each Egg has its own requirements for crafting. The general rule for a Domination Rex Egg is:\r\n3 Specific Artifacts\r\n2 types of Alpha parts\r\n50 Element\r\n\r\nDomination Rex has a saddle, but it's not required to be ridden.\r\n\r\nIMPORTANT! There is currently a bug with the camouflage, where it doesnt make the Dominator disappear if you log out/relog into a SP game. The camouflage still works though, it's only a visual bug, and doesn't seem to happen on servers. At the moment I haven't yet figured out a fix for this.\r\n\r\nThe Rig was provided by TruongCGArtist, the model was heavily modified by me, and ALL animations have been done by me.\r\n\r\n[url=https://discord.gg/CkxgGWC][img]https://i.imgur.com/9VyOYSB.png[/img][/url]\r\n[url=http://ko-fi.com/garuga][img]https://i.imgur.com/y2Z84XD.png[/img][/url]\r\n[url=https://www.patreon.com/Garuga123][img]https://i.imgur.com/j8adlIs.png[/img][/url]\r\n[url=https://www.twitch.tv/aegis575][img]https://i.imgur.com/u68UElC.png[/img][/url]\r\n\r\nThis mod/code/work is protected by the [URL=http://creativecommons.org/licenses/by-nc-nd/4.0/legalcode]Attribution-NonCommercial-NoDerivatives 4.0 International Creative Commons License.\r\n[IMG]https://i.creativecommons.org/l/by-nc-nd/4.0/88x31.png[/IMG][/URL]\r\n","time_created":1532031851,"time_updated":1557285101,"visibility":0,"banned":0,"ban_reason":"","subscriptions":152043,"favorited":5740,"lifetime_subscriptions":253424,"lifetime_favorited":6530,"views":137737,"tags":[]}]}}