{"response":{"result":1,"resultcount":1,"publishedfiledetails":[{"publishedfileid":"679529026","result":1,"creator":"76561198190427309","creator_app_id":346110,"consumer_app_id":346110,"filename":"","file_size":1365998905,"file_url":"http://depotcontent.akamai.steamusercontent.com/staticcontent/346110/614094907/depot_346110_6413680328998544701.zip","hcontent_file":"6413680328998544701","preview_url":"https://steamuserimages-a.akamaihd.net/ugc/795364666825408890/A392DC57E787E50D433CAAB39C8E2A07389F9F41/","hcontent_preview":"795364666825408890","title":"Ark Steampunk Mod","description":"MOD ID:\r\n679529026\r\n\r\n\r\n\r\n[img]https://i.imgur.com/hoO1UkW.png[/img]\r\nhissssss Snap twang Clang Never mind that steady Whirr of what may be gears.\r\n\r\nIntroduced to your ears are sounds from another time. Something that just doesn't quite add up to everything else that's taken place. Something that just doesn't quite blend...\r\n\r\n\r\nIt wouldn't take one to terribly long to come across just what it was that was making all those assorted sounds. Though the structure seemed empty.. as if it had simply been sitting here for some time without a caretaker. A steady pace around the elaborate, laid out home gave way to one trying to figure out just how it worked. How things continued to run and apparently un-assisted. Surely, a caretaker was needed for something so exquisite?\r\n\r\n\r\nEach dancing detail, the way the light shown from the solid metal surfaces. The vibration that danced through ones feet upon certain platforms and that ever going white cloud of steam that continued to puff along in the rather-near distance.\r\n\r\nContinuing ones pace around towards that steady puff of white, placing a hand against the ever turning machine that made such, listening. That steady humm of gears, the soft sounds of liquid dancing about within a chamber. The heat, that radiated off the constant motion. Unable to help but slowly peel one's gaze away to come across a rather large statue of a man. Just below his statue, the words sat inscribed \"Dr. Rubeus Oswald.\"\r\n\r\nA doctor? Of what? Who was he and why was his name here? Questions upon more questions and less answers to be found. Upon arriving at what appeared to be a doorway, one could only step back and take a moment to admire the simplicity of it. At least, the seeming simplicity until one garnered a closer look!\r\n\r\n\r\nCrossing the threshold led one to believe they'd stepped into another world - If one thought they'd stumbled across something of mystery to behold upon the outside, the inside would only lead to more confusion. Luckily for you survivors.. a leather bound journal would easily be found, laying open to a simple note..\r\n\r\n*Share these schematics with all, Take my lifetime's worth of knowledge and survive!\" Signed, Yours Truly, Dr. Rubeus Oswald. Flipping through those hand-pressed pages one would find schematic after schematic of building parts, strange flying contraptions, armor, and an almost never-ending guide to so much more.\r\n[img]https://i.imgur.com/L10BjSS.png[/img]\r\n\r\nSteampunk Schematics include:\r\n[list]\r\n[*]Modular Building Set (Copper, Grated, Pipe, Glass and more!)\r\n[*]Steampunk Armor Set\r\n[*]Steampunk Airship\r\n[*]Steambot\r\n[*]Steam Submarine\r\n[*]Steam Mech Rhino\r\n[*]Magnetic Trike Generator\r\n[*]Coil Teleport\r\n[*]Tesla Coils\r\n[*]Copper Lights\r\n[*]Bedroom Decor (Dressers, Bed, Lamps, etc..)\r\n[*]Icebox, Coal Stove, Steam Cooking Pot, Coal Smoker, and Smoke Spoiler.\r\n[*]Wardrobe (Currently only female outfits, more to come!)\r\n[*]Decor ( Statues, Mannequin and more..\r\n[*]Hydro Crafter and Planter (New Planting and growing system)\r\n[*]Copper Generator, Cables and Outlets\r\n[*]Copper Blast Forge, Industrial Copper Forge, Multi-Forge\r\n[*]Ankylo Shock Armor/Forge\r\n[*]Two Hot Airballons\r\n[*]Copper Behemoth Gate and Walls\r\n[*]Other Structures including Gazebo, Bed, and Stairs\r\n[*]Copper Grinder and Recycler.\r\n[*]Tree and Cliff Platforms\r\n[*]And much more!\r\n[/list]\r\n\r\nMod Discord and Support. Need Help?\r\nIf you're having an issue you can't figure out or just wanna hang out and maybe get some sneak previews of things to come, join our discord by clicking the Link below :-)\r\n[discord.gg] https://discord.gg/XVfCsjt\r\n\r\n\r\n\r\n\r\nAdmin Spawn Code[steampunkmod.com]\r\nSteampunk Wiki[steampunkmod.com]\r\nPatch Notes [https://steamcommunity.com/sharedfiles/filedetails/changelog/679529026]\r\n\r\nThanks to PaganSpirit, Gorefangs, Dragon, Koala, and Akevabanshee from my community discord for all the help with the filming server and mod description and more thanks!\r\n\r\nManual Download: https://drive.google.com/open?id=178MHpynQ64NcLnolUdR1tVw0BjgU1rCF","time_created":1462551534,"time_updated":1581115352,"visibility":0,"banned":0,"ban_reason":"","subscriptions":326990,"favorited":9940,"lifetime_subscriptions":597794,"lifetime_favorited":11556,"views":381645,"tags":[{"tag":"Mod"},{"tag":"Structures"},{"tag":"Weapons"},{"tag":"Outfits"},{"tag":"Creatures"},{"tag":"Visuals/Sounds"},{"tag":"Rebalancing"}]}]}}