{"response":{"result":1,"resultcount":1,"publishedfiledetails":[{"publishedfileid":"751991809","result":1,"creator":"76561198024182120","creator_app_id":346110,"consumer_app_id":346110,"filename":"","file_size":1258853,"file_url":"http://depotcontent.akamai.steamusercontent.com/staticcontent/346110/614094907/depot_346110_4961825701214985552.zip","hcontent_file":"4961825701214985552","preview_url":"https://steamuserimages-a.akamaihd.net/ugc/937214408383390195/C2F07006F631B25942617AA9AD11F85057BD945E/","hcontent_preview":"937214408383390195","title":"Death Recovery Mod (v1.11.2)","description":"[img]https://i.imgur.com/DoJ1Cdc.png[/img]\r\nVersion 1.11.2\r\nMod ID: 751991809 \r\nLast Cooked with DevKit: 297.2\r\nThis mod is rated: Clean and Stackable\r\n\r\nBrought to you by Manalo and [url=https://www.dragonclawstudios.com/]DragonClaw Studios![/url]\r\n\r\nThis mod provides a personal Gravestone that will help you recover your lost items (from death). \r\n\r\nCraft and place your personal Gravestone to use after you have died. I recommend placing it within a reasonable proximity to a bed. \r\n\r\nTribes can arrange these in a Graveyard fashion. Each stone can only be used by the person that placed it. \r\n\r\nOnce activated any objects found on all of your corpses or your death caches will be returned to your inventory. \r\n\r\n*** New Feature ***\r\nOverflow handling of objects has been added.  So when recovering lost items if you fill up before recovering everything the overflow will be placed in a cache at your feet.  If for any reason the item cannot be added to the cache(s) it will be put back in the object it was found in.\r\n\r\nEnable debugging if your concerned about lost items, the last set of stats will show you if anything was lost.\r\n\r\nThere is a 30 sec cool-down between usages to prevent spamming which could create performance issues, this timer can be adjusted using the game options listed bellow.\r\n\r\nThe ExclusionList is case insensitive, meaning you don't have to worry about caps.   I recommend you continue using them as it improves your ability to manage the data, but if you messup you don't have to worry about it as long as the entry is properly spelled (so it matches the item).\r\n\r\nThe grave stone will take damage over time so be sure to do regular maintenance.\r\n\r\nYou will no longer be able to pickup the stone if the timer is running or if it is damged.\r\n\r\nIf you own multiple stones they will all share the same timer.\r\n\r\nA Newly placed stone will inherit the timer from any existing stones for that user.\r\n\r\nWhen items are found a new affect, Flame of Recovery will occur letting you know the stone has started to recover items.  Flames will last 5 seconds (longer then it takes to actually recover items).\r\n\r\nIf no flames show up then no items were found, so nothing will be recovered.\r\n\r\nThanks to Firespark81 for the indirect idea for the Flame of Recovery.\r\n\r\nAdmin command to summon a personal stone: \r\ncheat gfi Personal_Grave 1 0 0\r\n\r\n**  The following settings are OPTIONAL!!                                      **\r\n**  Do not add a setting to your ini unless you need to change  **\r\n**  it from the default.  The following settings are NOT default   **\r\n**  They are examples of what you MIGHT do with them.             **\r\n\r\nSetting options for GameUserSettings.ini\r\n\r\n[DeathRecovery]\r\nDelayTimer=15\r\nDisableDecay=true\r\nDecayMultiplier=0.142857\r\nMaxLifeSpan=120\r\nDisablePickup=true\r\nUseOnce=true\r\nThereCanOnlyBeOne=true\r\nuseGlobalTimer=true\r\nExclusionList=PrimalItem_WeaponGPS,PrimalItem_TekRifle\r\n\r\nTo change the decay timer on the stone set DelayTimer to the number of seconds you desire.\r\n\r\n1 min = 60\r\n5 min = 300\r\n30 min = 1800\r\n1 hour = 3600\r\n1 day =  86400\r\n\r\nTo make the stone decay in one day (RL) set the DecayMultiplier to 0.142857\r\n\r\nI don't recommend having the stone decay faster then 3 days.\r\n\r\nIf you need to remove stones quickly then I recommend you use MaxLifeSpan.\r\n\r\nMaxLifeSpan is set by  choosing how many seconds to stone can exist. \r\n\r\nDisablePickup=true will disable the option that allows the stone to be picked up.\r\n\r\nUseOnce=true will cuase the stone to be destroyed once the stone is used.  \r\n\r\nWhen UseOnce is set the DelayTimer determins how long until the stone is destroyed.  While the stone is on cooldown it can't be used.\r\n\r\nThereCanOnlyBeOne=true will prevent the player from placing more than one stone.  (this will have no affect on existing stones).\r\n\r\nUseGlobalTimer=true will cause all stones in the game to use the same cooldown timer, all players will be affected, first come first use.\r\n\r\n**** Wild Cards are Back! ****\r\nThe ExclusionList now works with the wildcard character '.' you can place it at the begining or end of your string.  You can place one at one end or the other or both.\r\n\r\nExclusionList=PrimalItemResource.,.Thatch,.Consum.\r\n\r\nThis example would not recover any resources, anything that had Thatch at the end of the name or the partial work 'Consum' anywere in the name.\r\n\r\nFor those looking to do engram over rides the engram for this mod is: EngramEntry_Personal_Grave\r\n\r\n********************* WARNING **********************\r\nThe game deletes any corpse or loot cache that goes outside the map boundries.  How agressive this is depends on the map designer.\r\n\r\nAt times being killed by a sea creature can cuase your inventory to be removed/deleted from your corpse.\r\n\r\nThis mod cannot recover items that have been deleted by the game.\r\n**********************************************************\r\n\r\n====================================\r\nKNOWN ISSUES:\r\n* Flame of Recovery may not be showing when stone is activated and items are recovered.  If this occurs you need to pickup the stone and re-place it.\r\n====================================\r\n\r\nIf you are having trouble getting good files from Steam you can use this Google Drive link to download a copy of the mod directly.  \r\n\r\nhttps://drive.google.com/open?id=15ZS57m_A7QG_XYvYkMS0jyToB9EylIJc\r\n** DISCLAIMER **\r\nNever trust a download, always check it with a Virus Checker.   My system is clear of Viruses, Google is clear to the best of their ability to check files but that is not enough to ensure you are safe.  PLEASE SCAN THE FILE to ensure you are safe.\r\n\r\nThe mod is free and comes with limited support (when I'm available).  You can leave messages here on Steam or stop by the [url=https://discord.gg/gQn7c87]DragonClaw Studio's Discord[/url].\r\n\r\nIf you like this mod and would like to donate please click on the donation link below.\r\n[url=https://paypal.me/steamManalo][img]https://i.imgur.com/3z5rgA6.png[/img][/url]\r\n\r\n[img]https://steamcdn-a.akamaihd.net/steamcommunity/public/images/avatars/15/15fd7fa055d0b7325aaf8002efd7b6ef8df49509_full.jpg[/img]\r\nIf your looking for a gaming community feel free to stop by the Orion Cluster [url=https://discord.gg/E94Muqz]Discord[/url]. We play a number of games, share, chat and have some fun.","time_created":1472179957,"time_updated":1577417714,"visibility":0,"banned":0,"ban_reason":"","subscriptions":852200,"favorited":16814,"lifetime_subscriptions":1167333,"lifetime_favorited":18654,"views":300657,"tags":[{"tag":"Mod"}]}]}}